Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E10A.tmx
Source language: en_us
Languages: zh_cn

source: Beef Up Your Ranch Kitchen
zh_cn: 升级你的小厨房

source: Ranch-style homes are notorious for having small kitchens. While the trend is to open these kitchens up by knocking down walls and creating open-plan living areas, there are other options.
zh_cn: 乡村农场风格的房子多因厨房小而评价不高，时下的潮流都是把墙推倒、创造开放式的生活领域，但是我们还有其他选择。

source: There are benefits to working in a small kitchen.
zh_cn: 在小厨房里干活是有好处的。

source: For one, everything is at your fingertips. Your triangular arrangement of sink, stove and refrigerator is tight, making cooking an easy dance between the three.
zh_cn: 首先，一切事物尽在你的指尖：水槽、灶台和冰箱是你精心安排的三角，游走其间，烹饪好似成了一曲轻盈之舞。

source: Second, a closed-off kitchen means the mess and smells stay somewhat hidden.
zh_cn: 其次，一个封闭的厨房意味着厨房里的杂乱和味道相对也比较隐藏。

source: Third, small kitchens make it difficult for several people to work at once.
zh_cn: 第三，小厨房使得几人一起立刻开工变得困难。

source: While that might be a detriment to some, I love it!
zh_cn: 这对有些人而言大概是个坏事儿，但是我就喜欢这样！

source: I love keeping my kitchen to myself, working in my own little space and knowing exactly where every little thing is.
zh_cn: 我喜欢一人独占属于我自己的厨房，在我小小空间里挥洒厨艺，清楚地知道每一件小东西的位置。

source: Join me today as we look at some ideas for making your ranch kitchen work better.
zh_cn: 为了让你的农场式厨房更好的发挥作用，来看看吧！

source: Faiella Design
zh_cn: Faiella Design的传统厨房

source: When space is tight, every inch counts-including the ceiling.
zh_cn: 当空间处于紧张状态时，每一英尺都很有价值——包括天花板。

source: Make a grand statement with the lighting in your kitchen and draw the eye up.
zh_cn: 好好发挥厨房灯光效果，把你的视线向上引。

source: Visually expanding the space upward is a welcome distraction from crowded corners.
zh_cn: 在拥挤的角落里，向上看有开阔的视野是个受欢迎的转移之法。

source: Amy Birdsong
zh_cn: Amy Birdsong的折衷式厨房

source: Perhaps you would like to add a little life to your kitchen.
zh_cn: 也许你想要给厨房增添一些生机。

source: Why not try a bold paint color on your cabinets?
zh_cn: 试试往橱柜涂上大胆的颜色吧！

source: This yellow-green really gives this kitchen an injection of personality.
zh_cn: 上图中的黄绿色就为厨房注入了独特个性。

source: Rina Magen
zh_cn: Rina Magen的现代厨房

source: A ranch-style kitchen is typically small, so instead of trying to fight the obvious, why not play off its scaled-down nature?
zh_cn: 农场式厨房通常非常小，与其在看得见的地方苦苦开拓，不如展现它的天然小巧。

source: Instead of a giant copper hood, go for a smaller-size hood and stovetop to fit the space.
zh_cn: 不要买一个巨大的铜制油烟罩，适应空间买一个更小号的油烟罩和灶台吧。

source: Praktyczne i Pi?kne
zh_cn: Praktyczne i Pi?kne的折衷式厨房

source: When storage space is lacking, consider moving some kitchen items to another room.
zh_cn: 在缺乏储存空间时，考虑下把一些厨房用品移到另一个房间吧。

source: Using a traditional hutch or an updated thrift store dresser is a great way to store additional dishes and flatware in an unused nook of your dining room.
zh_cn: 要储藏多余的盘子和餐具，在餐厅不起眼的角落里用传统的箱子或是时兴的二手店梳妆台会是个更好的办法。

source: Laurie Burke
zh_cn: Laurie Burke的传统厨房

source: The absolute number-one improvement for a small ranch kitchen is to add a window above the sink.
zh_cn: 对于一个小型 农场式厨房而言，改进的第一选择自然是在水池上添一扇窗。

source: It is a classic placement for a window, and many ranch homes are already blessed with one.
zh_cn: 对窗户而言，这也是一个经典的位置，而许多的农场式家庭里也已经很幸运的有了一扇。

source: Breaking up the bowling alley feel and offering a vista from the cozy nest of your kitchen is a much-needed boost to the ranch kitchen.
zh_cn: 打破保龄球场的感觉并从厨房保温罩巢处增添一个视线，对厨房而言，这是一个亟待提升的部分。

source: Extending out with a bay window is even better.
zh_cn: 如果是凸窗就更好了。

source: NURIT GEFFEN-BATIM STUDIO
zh_cn: NURIT GEFFEN-BATIM STUDIO的地中海式厨房

source: Here is another way of creating a bay-window effect in a modern composition.
zh_cn: 要创造出凸窗的效果还有个还有一个现代的办法。

source: Notice how the countertop extends into the nook behind the sink, leaving plenty of rooms for herbs, sprouts and other plants.
zh_cn: 请注意上图中工作台面是怎样向水槽后方的角落延伸的，这样就给草药、绿芽和其他的植物带来了很大的空间。

source: Pangaea Interior, Portland, OR
zh_cn: 美国奥勒冈州波特兰的Pangaea Interior 设计的当代厨房

source: Extending the window to the ceiling completely opens up the space in a tiny kitchen.
zh_cn: 把窗户拓展到天花板也能完全的打开一个小厨房的空间。

source: Imagine how dark this kitchen would be without this large expanse of glass.
zh_cn: 想象下，如果没有了这块巨大宽敞的玻璃，这个厨房会有多黑。

source: The juxtaposistion of sunlight with the deep, dark wood in the space is just right.
zh_cn: 上图中，阳光静静地同空间里又深又黑的木头毗邻而居。

source: Michael Minadeo+Partners
zh_cn: Michael Minadeo和搭档们的厨房

source: If you have low ceilings (hello, classic ranch), you may not have the ability to put in a large bank of tall windows.
zh_cn: 如果你有低低的天花板（你好呀，典型的农场），你也许没办法置办进一大堆高窗户。

source: You might, however, have a nice long, horizontal space for a row of windows.
zh_cn: 但是，你也许可以有一列长长的水平窗子。

source: The windows here serve as a perfect frame for the mountains outside, and I bet there is fighting over who gets to do the dishes in this kitchen!
zh_cn: 窗户给远山提供了完美的架构，我猜这样一来就不会为了谁洗盘子而吵架啦！

source: Cuppett Architects
zh_cn: Cuppett Architects的传统厨房

source: Working with small spaces in a traditional ranch-style home can often be a challenge, but it is possible to create a space you love to live in.
zh_cn: 在农场式风格的家里工作常常会成为一个挑战，但是你仍然可以创造一个自己喜爱的居住之地。

source: By utilizing creative storage, opening up views with windows and other features, and giving your space life and personality, you can truly make your ranch kitchen a pleasing home on the range.
zh_cn: 通过有创意地利用储藏、用窗户打开视野和其他的特点，赋予你的空间以活力和个性，你可以真正的在范围内将你的农场式厨房创造成一个让人愉悦的家。
